app/views/posts/_like_text.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
<% if likes.size == 1 %>
    <strong><%= likes.first.user.name %></strong> likes this
<% elsif likes.size == 2 %>
  <strong><%= likes.first.user.name %></strong> and <strong><%= likes.second.user.name %></strong> like this