app/views/posts/_like_icon.html.erb

<% if post.is_liked(current_user).present? %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (?, ?, ?, ?, ?, ?) ORDER BY "likes"."created_at" DESC  [["post_id", 28], ["post_id", 27], ["post_id", 26], ["post_id", 22], ["post_id", 20], ["post_id", 19]]