app/views/posts/_photos.html.erb

<%= link_to post_path(post) do %>
<% if post.photos.size == 1 %>
  <%= image_tag post.photos.first.image.url(:standard), class: "card_img_top" %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."post_id" IN (?, ?, ?, ?, ?, ?)  [["post_id", 28], ["post_id", 27], ["post_id", 26], ["post_id", 22], ["post_id", 20], ["post_id", 19]]
SELECT COUNT(*) FROM "photos" WHERE "photos"."post_id" = ?  [["post_id", 28]]
SELECT "photos".* FROM "photos" WHERE "photos"."post_id" = ? ORDER BY "photos"."id" ASC LIMIT ?  [["post_id", 28], ["LIMIT", 1]]

    <div class="carousel-inner">
        <% post.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."post_id" = ?  [["post_id", 29]]