app/controllers/posts_controller.rb

  def index
    @posts = Post.all.limit(10).includes(:photos, :user, :likes).order('created_at desc')
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (?, ?, ?, ?, ?, ?, ?) ORDER BY "likes"."created_at" DESC  [["post_id", 28], ["post_id", 27], ["post_id", 26], ["post_id", 25], ["post_id", 22], ["post_id", 20], ["post_id", 19]]
SELECT "photos".* FROM "photos" WHERE "photos"."post_id" IN (?, ?, ?)  [["post_id", 1], ["post_id", 2], ["post_id", 3]]
SELECT "posts".* FROM "posts" ORDER BY created_at desc LIMIT ?  [["LIMIT", 10]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 2], ["id", 1]]

  def create
    @post = current_user.posts.build(post_params)

    if !params[:images]
      flash[:alert] = "No image selected"
      redirect_to posts_path
      return
    end


    if @post.save
      if params[:images]
        params[:images].each do |img|
          @post.photos.create(image: img)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Mehrere Bilder"], ["user_id", 1], ["created_at", "2021-06-18 13:57:23.464980"], ["updated_at", "2021-06-18 13:57:23.464980"]]
INSERT INTO "photos" ("image", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", "vplhzi6gsx4kjizwjb4q.jpg"], ["post_id", 29], ["created_at", "2021-06-18 13:57:23.475395"], ["updated_at", "2021-06-18 13:57:23.475395"]]

  def show
    @photos = @post.photos
    @likes = @post.likes.includes(:user)
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? ORDER BY "likes"."created_at" DESC  [["post_id", 26]]
SELECT "photos".* FROM "photos" WHERE "photos"."post_id" = ?  [["post_id", 25]]

  def destroy
    if @post.user == current_user
      if @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 25]]

  def find_post
    @post = Post.find_by id: params[:id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]